In [1]:
from __future__ import (absolute_import, division,
                        print_function, unicode_literals)
# отключим предупреждения Anaconda
import warnings
warnings.simplefilter('ignore')
import pandas as pd
import numpy as np
%matplotlib inline
import matplotlib.pyplot as plt

In [2]:
data = pd.read_csv('adult.data.csv')
data.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [4]:
data.sex.value_counts()

Male      21790
Female    10771
Name: sex, dtype: int64

In [6]:
data.loc[data['sex']=='Female', 'age'].mean()

36.85823043357163

In [9]:
data['native-country'].value_counts(normalize=True)

United-States                 0.895857
Mexico                        0.019748
?                             0.017905
Philippines                   0.006081
Germany                       0.004207
Canada                        0.003716
Puerto-Rico                   0.003501
El-Salvador                   0.003255
India                         0.003071
Cuba                          0.002918
England                       0.002764
Jamaica                       0.002488
South                         0.002457
China                         0.002303
Italy                         0.002242
Dominican-Republic            0.002150
Vietnam                       0.002058
Guatemala                     0.001966
Japan                         0.001904
Poland                        0.001843
Columbia                      0.001812
Taiwan                        0.001566
Haiti                         0.001351
Iran                          0.001321
Portugal                      0.001136
Nicaragua                     0.001044
Peru                          0.000952
France                        0.000891
Greece                        0.000891
Ecuador                       0.000860
Ireland                       0.000737
Hong                          0.000614
Cambodia                      0.000584
Trinadad&Tobago               0.000584
Thailand                      0.000553
Laos                          0.000553
Yugoslavia                    0.000491
Outlying-US(Guam-USVI-etc)    0.000430
Hungary                       0.000399
Honduras                      0.000399
Scotland                      0.000369
Holand-Netherlands            0.000031
Name: native-country, dtype: float64

In [10]:
data['salary'].value_counts()

<=50K    24720
>50K      7841
Name: salary, dtype: int64

In [12]:
data.loc[data['salary']=='>50K','age'].agg(['mean','std'])

mean    44.249841
std     10.519028
Name: age, dtype: float64

In [13]:
data.loc[data['salary']=='<=50K','age'].agg(['mean','std'])

mean    36.783738
std     14.020088
Name: age, dtype: float64

In [14]:
data.loc[data['salary']=='>50K','education'].value_counts()

Bachelors       2221
HS-grad         1675
Some-college    1387
Masters          959
Prof-school      423
Assoc-voc        361
Doctorate        306
Assoc-acdm       265
10th              62
11th              60
7th-8th           40
12th              33
9th               27
5th-6th           16
1st-4th            6
Name: education, dtype: int64

In [30]:
df = pd.crosstab(data['salary'],data['marital-status'], margins=True)
df

marital-status,Divorced,Married-AF-spouse,Married-civ-spouse,Married-spouse-absent,Never-married,Separated,Widowed,All
salary,,,,,,,,
<=50K,3980,13,8284,384,10192,959,908,24720
>50K,463,10,6692,34,491,66,85,7841
All,4443,23,14976,418,10683,1025,993,32561

In [31]:
list_married = ['Married-AF-spouse','Married-civ-spouse','Married-spouse-absent']

In [39]:
list_unmarried =[e for e in df.columns.tolist() if e not in list_married + ['All']]

In [40]:
list_unmarried

['Divorced', 'Never-married', 'Separated', 'Widowed']

In [48]:
df.loc[:,list_married]

marital-status  Married-AF-spouse  Married-civ-spouse  Married-spouse-absent
salary
<=50K                          13                8284                    384
>50K                           10                6692                     34
All                            23               14976                    418

In [49]:
df_mar = df.loc[:,list_married].sum(axis=1)

In [54]:
df_mar

salary
<=50K     8681
>50K      6736
All      15417
dtype: int64

In [53]:
df_unmar = df.loc[:,list_unmarried].sum(axis=1)

In [52]:
df_mar['>50K'] / df_mar['All']

0.43692028280469614

In [55]:
df_unmar['>50K'] / df_unmar['All']

0.0644540363975735

In [17]:
data.loc[data['race']=='Amer-Indian-Eskimo','age'].max()

82

In [58]:
data['hours-per-week'].max()

99

In [60]:
data.loc[data['hours-per-week'] == 99].shape[0]

85

In [61]:
data.loc[data['hours-per-week'] == 99, 'salary'].value_counts(normalize=True)

<=50K    0.705882
>50K     0.294118
Name: salary, dtype: float64

In [63]:
data.loc[(data['native-country']=='Japan') & (data['salary']=='>50K'), 'hours-per-week'].mean()

47.958333333333336

In [64]:
data.loc[(data['native-country']=='Japan') & (data['salary']=='<=50K'), 'hours-per-week'].mean()

41.0